In [1]:
import numpy as np
import pandas as pd

# Pandas Series

In [2]:
# Create pd series
labels = ['a', 'b', 'c']
my_list = [10,20,30]
arr = np.array(my_list)
arr

array([10, 20, 30])

In [3]:
# Create a diccionary
d = {'a':10, 'b':20, 'c':30}

In [4]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int32

In [6]:
# Not all the values must be of the same type
pd.Series([10,'b',2.3])

0     10
1      b
2    2.3
dtype: object

In [7]:
ser1 = pd.Series([1,2,3,4], index=["USA", "GERMANY", "USSR", "JAPAN"])
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [8]:
# You can use named index to retrieve values
ser1["USA"]

1

In [9]:
ser2 = pd.Series([1,4,5,6], index=["USA", "ITALY", "USSR", "JAPAN"])
ser2

USA      1
ITALY    4
USSR     5
JAPAN    6
dtype: int64

In [10]:
# We can perform operations in named index that match
ser1 + ser2

GERMANY     NaN
ITALY       NaN
JAPAN      10.0
USA         2.0
USSR        8.0
dtype: float64

# Pandas DataFrames

In [11]:
from numpy.random import randn
np.random.seed(101)
rand_mat = randn(5,4)
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [12]:
df = pd.DataFrame(rand_mat, index= "A B C D E".split(), columns="W X Y Z".split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
# Select a single column
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
# Select several columns
my_cols = ["W","Y"]
df[my_cols]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [15]:
# Or
df[["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [16]:
# Create a new column
df["NEW"] = df["W"] + df["Y"]
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
# Remove a column. Due that default axis is 0 (rows) we have to specify it
df.drop("NEW", axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
# This chanfe it is'nt permannent
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [19]:
# We hace to use inplace ti do that
df.drop("NEW", axis=1, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
# The same for rows axis=0 default
df.drop('A')

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
# There are two ways for selecting rows
print(df.loc["A"])
print(df.iloc[0])

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64
W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [22]:
# Selecting multiple rows
df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [23]:
df.iloc[:3]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [24]:
# More complex selection
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

## Conditional selection

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df_bool = df > 0
df_bool

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [27]:
# Selection with a condition that applies to all dataframe
df[df_bool]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
# Condition applies only to a column
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
# Multiple conditions are also possible
cond1 = df["W"] > 0
cond2 = df["Y"] > 1
df[cond1 & cond2]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [30]:
# Reset index means that it creates a new column with the name of the index, an a normal index instead
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
# We can create a new index
new_ind = "CA NY WY OR CO".split()
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [33]:
df["States"] = new_ind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [34]:
df.set_index('States', inplace=True)

In [35]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Get summaries from a dataframe

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [37]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [38]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [39]:
# Know how many values
ser_w = df["W"] > 0
ser_w.value_counts()

True     4
False    1
Name: W, dtype: int64

# Missing datas with pandas

In [40]:
import numpy as np
import pandas as pd

In [41]:
df = pd.DataFrame({"A":[1,2,np.nan],"B":[5,np.nan,np.nan], "C":[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
# Option 1 (Do nothing)

In [43]:
# Option 2 (remove all rows with missing data)
df.dropna()

     A    B  C
0  1.0  5.0  1

In [44]:
# Option 2b (remove all columns with missing data)
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [45]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [46]:
# We can fill all missing values with an specific one
df.fillna(value="FILLNA")

        A       B  C
0       1       5  1
1       2  FILLNA  2
2  FILLNA  FILLNA  3

In [47]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [48]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [49]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby Operations

In [50]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [51]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [52]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [53]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [54]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Common operations

In [55]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [56]:
# Figure out unique values
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [57]:
# Number of unique values
df["col2"].nunique()

3

In [58]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [59]:
# Select rows col1 > 2 and col2 = 444
newdf = df[(df['col1']>2) & (df['col2'] == 444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [60]:
def times_two(number):
    return number * 2

In [61]:
times_two(3)

6

In [62]:
df["col1x2"] = df['col1'].apply(times_two)
df

   col1  col2 col3  col1x2
0     1   444  abc       2
1     2   555  def       4
2     3   666  ghi       6
3     4   444  xyz       8

In [63]:
del df['col1x2']
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [64]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [65]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [67]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [68]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# Data input and ouput

In [69]:
import pandas as pd

In [70]:
pwd

'C:\\Users\\Rafa\\OneDrive\\Jupyter Notebooks\\my_notebooks1\\Udemy Time Series Analysis'

In [71]:
df = pd.read_csv('./data/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [73]:
newdf = df[['a','b']]
newdf

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

In [77]:
newdf.to_csv('newdf.csv', index=False)

In [ ]:
# Read an Excel file
pd.read_excel('./data/Excel_Sample.xlsx', sheet_name=)